[
  {
    "id": 1,
    "image": "https://i.ibb.co.com/bb6TpwC/Project1.png",
    "name": "EquiSports",
    "description": "EquiSports is an online sports equipment shop offering premium sports gear. It provides seamless user authentication, interactive cart and wishlist management, and dynamic product displays with a mobile-responsive design. This was one of my earlier project. I did this when I first started learning React. I was trying out whatever I learned about React in a very short amount of time in this particular project, which as I can imagine you can find out just by visiting the website. I showcased this project so that you can have a vague idea about my improvement rate over time.",
    "liveLink": "https://assginments-2e056.web.app",
    "githubClient": "https://github.com/programming-hero-web-course2/b10-a10-client-side-kyoChiwow",
    "githubServer": "https://github.com/programming-hero-web-course2/b10-a10-server-side-kyoChiwow",
    "technologyStack": "React.js, Tailwind CSS, DaisyUI, Firebase Authentication, Firebase Database, Vite, Firebase Hosting"
    
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/LnjjSFQ/Project2.png",
    "name": "Querious",
    "description": "Querious is a product recommendation platform providing tailored product suggestions, query filtering, wishlist management, and product reviews. It is optimized for responsive design and personalized user experiences. This particular project was done when I was still getting used to using React Router. You can even say that I was not used to React by then. There was some repeatation in code, many design flaws but the functionalities works perfectly. This is the first time found out that designing a website is just as challenging as developing a website.",
    "liveLink": "https://assignment-11-ebe19.web.app",
    "githubClient": "https://github.com/programming-hero-web-course2/b10a11-client-side-kyoChiwow",
    "githubServer": "https://github.com/programming-hero-web-course2/b10a11-server-side-kyoChiwow",
    "technologyStack": "React.js, Tailwind CSS, DaisyUI, Firebase Authentication, Firebase Database, Axios, React Router, Lottie-React, React Icons, Vite"
    
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/Y0SG5M7/Project3.png",
    "name": "Bistro Boss Restaurant",
    "description": "Bistro Boss Restaurant website is meant for restaurant management and online orders. This particular project gave me a lot of new things to learn as in, this was the first big full stack project that I did. When I was building this website, I found that in the earlier projects I was repeating codes alot and that costs me alot of time, so in this project I tried to avoid that and use hooks and tanstack query to avoid those. If you go to the live link you might see that some of the functionalities might not work thats because this is a work in progress. I just though I should mention this here as in this is my first big project.",
    "liveLink": "https://mile9pro4.web.app",
    "githubClient": "https://github.com/kyoChiwow/Bistro-Restaurant-Client-Side",
    "githubServer": "https://github.com/kyoChiwow/Bistro-Restaurant-Server-Side",
    "technologyStack": "React.js, Tailwind CSS, DaisyUI, Firebase Authentication, Firebase Database, Axios, React Router, Lottie-React, React Icons, Vite"
  }
]
